RefApp/rivta-bp-21-ip/java/cxf/trunk/rivta-bpip21-refapp-schemas/src/main/resources/schemas/interactions/MakeBookingInteraction/MakeBookingInteraction_1.1_rivtabpip21.wsdl

<?xml version="1.0" encoding="UTF-8"?>
<!-- 
 Licensed to the Apache Software Foundation (ASF) under one
 or more contributor license agreements. See the NOTICE file
 distributed with this work for additional information
 regarding copyright ownership. The ASF licenses this file
 to you under the Apache License, Version 2.0 (the
 "License"); you may not use this file except in compliance
 with the License. You may obtain a copy of the License at

 http://www.apache.org/licenses/LICENSE-2.0

 Unless required by applicable law or agreed to in writing,
 software distributed under the License is distributed on an
 "AS IS" BASIS, WITHOUT WARRANTIES OR CONDITIONS OF ANY
 KIND, either express or implied. See the License for the
 specific language governing permissions and limitations
 under the License.
 -->
<wsdl:definitions 
	name="MakeBookingInteraction"
	xmlns:wsdl="http://schemas.xmlsoap.org/wsdl/" 
	xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/" 
	xmlns:http="http://schemas.xmlsoap.org/wsdl/http/" 
	xmlns:xs="http://www.w3.org/2001/XMLSchema" 
	xmlns:soapenc="http://schemas.xmlsoap.org/soap/encoding/" 
	xmlns:mime="http://schemas.xmlsoap.org/wsdl/mime/" 
	xmlns:riv="urn:riv:itintegration:registry:1" 
	xmlns:tjs="urn:riv:crm:scheduling:MakeBookingResponder:1" 
	xmlns:tns="urn:riv:crm:scheduling:MakeBooking:1:rivtabpip21"
	xmlns:saml="urn:oasis:names:tc:SAML:2.0:assertion"
	targetNamespace="urn:riv:crm:scheduling:MakeBooking:1:rivtabpip21">

	<xs:annotation>
		<xs:documentation>
			Tjänsteinteraktionens namn: MakeBookingInteraction
			Beskrivning: 
				Interaction to make a new booking at a healthcare facility.
			Revisioner: 
				2009-10-26: Utkast Version 1.0, johan.eltes@callistaenterprise.se
				2010-04-21: Fastställd version 1.0, johan.eltes@callistaenterprise.se
				2011-03-XX: Fastställd version 1.1, johan.eltes@callistaenterprise.se
					- Se ändringslog i tjänsteschema
			Tjänstedomän: crm:scheduling
			Tjänsteinteraktionstyp: Fråga-svar
			RIV Teknisk Anvisning: Basic Profile 2.0
			Förvaltas av: Mina Vårdkontakter inom Inera AB
		</xs:documentation>
	</xs:annotation>

	<wsdl:types>
		<xs:schema targetNamespace="urn:riv:crm:scheduling:MakeBooking:1:rivtabp21">
			<xs:import schemaLocation="MakeBookingResponder_1.1.xsd" namespace="urn:riv:crm:scheduling:MakeBookingResponder:1"/>
			<xs:import schemaLocation="../../core_components/itintegration_registry_1.0.xsd" namespace="urn:riv:itintegration:registry:1"/>
			<xs:import schemaLocation="../../profile/saml-schema-assertion-2.0.xsd" namespace="urn:oasis:names:tc:SAML:2.0:assertion"/>
		</xs:schema>
	</wsdl:types>

	<wsdl:message name="MakeBookingRequest">
		<xs:annotation>
			<xs:documentation>
				LogicalAddress is the hsaid of the healthcare_facility owning he schedule in which the booking is to be made.
			</xs:documentation>
		</xs:annotation>
		<wsdl:part name="LogicalAddress" element="riv:LogicalAddress" />
		<wsdl:part name="HCAssertion" element="saml:Assertion"/>
		<wsdl:part name="parameters" element="tjs:MakeBooking" />
	</wsdl:message>

	<wsdl:message name="MakeBookingResponse">
		<wsdl:part name="parameters" element="tjs:MakeBookingResponse"/>
	</wsdl:message>

	<wsdl:portType name="MakeBookingResponderInterface">
	
		<wsdl:operation name="MakeBooking">
			<wsdl:input message="tns:MakeBookingRequest"/>
			<wsdl:output message="tns:MakeBookingResponse"/>
		</wsdl:operation>
		
	</wsdl:portType>
	
	<wsdl:binding name="MakeBookingResponderBinding" type="tns:MakeBookingResponderInterface">
		<soap:binding style="document" transport="http://schemas.xmlsoap.org/soap/http"/>

		<wsdl:operation name="MakeBooking">
			<soap:operation soapAction="urn:riv:crm:scheduling:MakeBookingResponder:1:MakeBooking"/>
			<wsdl:input>
				<soap:header use="literal" message="tns:MakeBookingRequest" part="LogicalAddress"/>
				<soap:header use="literal" message="tns:MakeBookingRequest" part="HCAssertion" />
				<soap:body use="literal" parts="parameters"/>
			</wsdl:input>
			<wsdl:output>
				<soap:body use="literal"/>
			</wsdl:output>
		</wsdl:operation>

	</wsdl:binding>

	<wsdl:service name="MakeBookingResponderService">
		<wsdl:port name="MakeBookingResponderPort" binding="tns:MakeBookingResponderBinding">
			<soap:address location="http://tempuri.org"/>
		</wsdl:port>
	</wsdl:service>
</wsdl:definitions>
