wiki/RefAppBasicProfile21ApacheCXF.wiki

#summary RIV Teknisk anvisning - Basic Profile v2.1 - Referensapplikation - Apache CXF Environment

=RIV Teknisk anvisning - Basic Profile v2.1 - Referensapplikation - Apache CXF Environment=

<wiki:toc max_depth="3" />

==Environment==

The reference application requires the following to be pre installed:

  * Java SE Development Kit v5.0 or later
    * [http://java.sun.com/javase/downloads/index.jsp download] 
  * Maven v2.0.9 or later
    * [http://maven.apache.org/download.html download] 
  * Any Subversion client
    * [http://http://subversion.apache.org/ download] 

==Checkout and build the reference application==

  # [http://code.google.com/p/rivta/source/checkout Checkout the source code]
  # mvn install

==Running the reference application==

===Producer===

  # `cd rivta-bp21-refapp-producer`
  # `mvn -e exec:java -Dexec.mainClass="se.skl.rivta.bp21.refapp.producer.Server"

This should produce output after running the consumer once similar to the following:

http://rivta.googlecode.com/svn/wiki/images/refApp/cxf-producer-rivtabp21.png

===Consumer===

  # `cd rivta-bp21-refapp-consumer`
  # `mvn -e exec:java -Dexec.mainClass="se.skl.rivta.bp21.refapp.consumer.crm.scheduling.Initiator"

This should produce output similar to the following:

http://rivta.googlecode.com/svn/wiki/images/refApp/cxf-consumer-rivtabp21.png

==Sample soap/http-request==

{{{

Address: /rivtabp21/refapp/MakeBookingResponderService
Encoding: UTF-8
Content-Type: text/xml; charset=UTF-8
Headers: {Content-Length=443, Host=localhost:11000, User-Agent=Apache CXF 2.2.1, connection=keep-alive, SOAPAction="urn:riv:crm:scheduling:MakeBookingResponder:1:MakeBooking", Pragma=no-cache, content-type=text/xml; charset=UTF-8, Cache-Control=no-cache, Accept=*/*}
Payload:

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:add="http://www.w3.org/2005/08/addressing" xmlns:urn="urn:riv:crm:scheduling:MakeBookingResponder:1" xmlns:urn1="urn:riv:crm:scheduling:1">
   <soapenv:Header>
      <add:To>1234561234</add:To>
   </soapenv:Header>
   <soapenv:Body>
      <urn:MakeBooking>
        
      </urn:MakeBooking>
   </soapenv:Body>
</soapenv:Envelope>
}}}

Sample response

{{{
<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
   <soap:Body>
      <MakeBookingResponse xmlns="urn:riv:crm:scheduling:MakeBookingResponder:1" xmlns:ns2="urn:riv:crm:scheduling:1" xmlns:ns3="urn:riv:crm:scheduling:1.1" xmlns:ns4="urn:riv:itintegration:registry:1">
         <bookingId>booking-null</bookingId>
         <resultCode>OK</resultCode>
         <resultText>Booking was made successfully</resultText>
      </MakeBookingResponse>
   </soap:Body>
</soap:Envelope>
}}}
==Prepare for development in Eclipse==

`mvn eclipse:eclipse`

==Overview of Maven modules==

  * schemas
    Contains XML Schemas and WSDL artefacts.
    Also responsible for generating JAXB and JAX-WS binding code. 

  * util
    Contains reusable code, log-settings and so on. 

  * producer
    Service producer. 

  * consumer
    Service consumer. 